_posts/programming/2023-09-23-cppcoreguidelines-t65.html
---
layout: post
title: CppCoreGuidelines T.65 通过标签分派机制提供函数的不同实现
categories: [technology]
tags: [CppCoreGuidelines]
---
<p>
<a href="http://kimi.im/tags.html#CppCoreGuidelines-ref">C++ 核心指南目录</a>
</p>

<p>
&ldquo;Use tag dispatch to provide alternative implementations of a
function&rdquo;
</p>

<p>
理由
</p>

<ul class="org-ul">
<li>模板定义了通用接口</li>
<li>标签分派机制允许我们基于参数的特定属性选择不同的实现</li>
<li>性能更好</li>
</ul>


<p>
例子
</p>

<p>
这是 <code>std::copy</code> 的简化版本。
</p>

<div class="org-src-container">
<pre class="src src-C++"><span style="color: #7F0055; font-weight: bold;">struct</span> <span style="color: #000000; font-style: italic; text-decoration: underline;">pod_tag</span> <span style="color: #707183;">{}</span>;
<span style="color: #7F0055; font-weight: bold;">struct</span> <span style="color: #000000; font-style: italic; text-decoration: underline;">non_pod_tag</span> <span style="color: #707183;">{}</span>;

<span style="color: #3F7F5F;">// T is not "plain old data"</span>
<span style="color: #7F0055; font-weight: bold;">template</span><span style="color: #707183; font-weight: bold;">&lt;</span><span style="color: #7F0055; font-weight: bold;">class</span> <span style="color: #000000; font-style: italic; text-decoration: underline;">T</span><span style="color: #707183; font-weight: bold;">&gt;</span> <span style="color: #7F0055; font-weight: bold;">struct</span> <span style="color: #000000; font-style: italic; text-decoration: underline;">copy_trait</span> <span style="color: #707183;">{</span> <span style="color: #7F0055; font-weight: bold;">using</span> <span style="color: #000000; font-style: italic; text-decoration: underline;">tag</span> <span style="color: #7F0055; font-weight: bold;">=</span> <span style="color: #000000; font-style: italic; text-decoration: underline;">non_pod_tag</span>; <span style="color: #707183;">}</span>;

<span style="color: #3F7F5F;">// int is "plain old data"</span>
<span style="color: #7F0055; font-weight: bold;">template</span><span style="color: #707183; font-weight: bold;">&lt;&gt;</span> <span style="color: #7F0055; font-weight: bold;">struct</span> <span style="color: #000000; font-style: italic; text-decoration: underline;">copy_trait</span><span style="color: #707183; font-weight: bold;">&lt;</span><span style="color: #7F0055; font-weight: bold;">int</span><span style="color: #707183; font-weight: bold;">&gt;</span> <span style="color: #707183;">{</span> <span style="color: #7F0055; font-weight: bold;">using</span> <span style="color: #000000; font-style: italic; text-decoration: underline;">tag</span> <span style="color: #7F0055; font-weight: bold;">=</span> <span style="color: #000000; font-style: italic; text-decoration: underline;">pod_tag</span>; <span style="color: #707183;">}</span>;

<span style="color: #7F0055; font-weight: bold;">template</span><span style="color: #707183; font-weight: bold;">&lt;</span><span style="color: #7F0055; font-weight: bold;">class</span> <span style="color: #000000; font-style: italic; text-decoration: underline;">Iter</span><span style="color: #707183; font-weight: bold;">&gt;</span>
<span style="color: #000000; font-style: italic; text-decoration: underline;">Out</span> <span style="color: #0000ff; font-weight: bold;">copy_helper</span><span style="color: #707183;">(</span><span style="color: #000000; font-style: italic; text-decoration: underline;">Iter</span> <span style="color: #000000;">first</span>, <span style="color: #000000; font-style: italic; text-decoration: underline;">Iter</span> <span style="color: #000000;">last</span>, <span style="color: #000000; font-style: italic; text-decoration: underline;">Iter</span> <span style="color: #000000;">out</span>, <span style="color: #000000; font-style: italic; text-decoration: underline;">pod_tag</span><span style="color: #707183;">)</span>
<span style="color: #707183;">{</span>
    <span style="color: #3F7F5F;">// use memmove</span>
<span style="color: #707183;">}</span>

<span style="color: #7F0055; font-weight: bold;">template</span><span style="color: #707183; font-weight: bold;">&lt;</span><span style="color: #7F0055; font-weight: bold;">class</span> <span style="color: #000000; font-style: italic; text-decoration: underline;">Iter</span><span style="color: #707183; font-weight: bold;">&gt;</span>
<span style="color: #000000; font-style: italic; text-decoration: underline;">Out</span> <span style="color: #0000ff; font-weight: bold;">copy_helper</span><span style="color: #707183;">(</span><span style="color: #000000; font-style: italic; text-decoration: underline;">Iter</span> <span style="color: #000000;">first</span>, <span style="color: #000000; font-style: italic; text-decoration: underline;">Iter</span> <span style="color: #000000;">last</span>, <span style="color: #000000; font-style: italic; text-decoration: underline;">Iter</span> <span style="color: #000000;">out</span>, <span style="color: #000000; font-style: italic; text-decoration: underline;">non_pod_tag</span><span style="color: #707183;">)</span>
<span style="color: #707183;">{</span>
    <span style="color: #3F7F5F;">// use loop calling copy constructors</span>
<span style="color: #707183;">}</span>

<span style="color: #7F0055; font-weight: bold;">template</span><span style="color: #707183; font-weight: bold;">&lt;</span><span style="color: #7F0055; font-weight: bold;">class</span> <span style="color: #000000; font-style: italic; text-decoration: underline;">Iter</span><span style="color: #707183; font-weight: bold;">&gt;</span>
<span style="color: #000000; font-style: italic; text-decoration: underline;">Out</span> <span style="color: #0000ff; font-weight: bold;">copy</span><span style="color: #707183;">(</span><span style="color: #000000; font-style: italic; text-decoration: underline;">Iter</span> <span style="color: #000000;">first</span>, <span style="color: #000000; font-style: italic; text-decoration: underline;">Iter</span> <span style="color: #000000;">last</span>, <span style="color: #000000; font-style: italic; text-decoration: underline;">Iter</span> <span style="color: #000000;">out</span><span style="color: #707183;">)</span>
<span style="color: #707183;">{</span>
    <span style="color: #7F0055; font-weight: bold;">return</span> <span style="color: #3a5fcd; font-weight: bold;">copy_helper</span><span style="color: #7388d6;">(</span>first, last, out, typename <span style="color: #000000; font-style: italic; text-decoration: underline;">copy_trait</span><span style="color: #909183; font-weight: bold;">&lt;</span><span style="color: #000000; font-style: italic; text-decoration: underline;">Value_type</span><span style="color: #709870; font-weight: bold;">&lt;</span><span style="color: #000000; font-style: italic; text-decoration: underline;">Iter</span><span style="color: #709870; font-weight: bold;">&gt;</span><span style="color: #909183; font-weight: bold;">&gt;</span>::<span style="color: #000000; font-style: italic; text-decoration: underline;">tag</span><span style="color: #909183;">{}</span><span style="color: #7388d6;">)</span>
<span style="color: #707183;">}</span>

<span style="color: #7F0055; font-weight: bold;">void</span> <span style="color: #0000ff; font-weight: bold;">use</span><span style="color: #707183;">(</span><span style="color: #000000; font-style: italic; text-decoration: underline;">vector</span><span style="color: #7388d6; font-weight: bold;">&lt;</span><span style="color: #7F0055; font-weight: bold;">int</span><span style="color: #7388d6; font-weight: bold;">&gt;</span><span style="color: #7F0055; font-weight: bold;">&amp;</span> <span style="color: #000000;">vi</span>, <span style="color: #000000; font-style: italic; text-decoration: underline;">vector</span><span style="color: #7388d6; font-weight: bold;">&lt;</span><span style="color: #7F0055; font-weight: bold;">int</span><span style="color: #7388d6; font-weight: bold;">&gt;</span><span style="color: #7F0055; font-weight: bold;">&amp;</span> <span style="color: #000000;">vi2</span>,
         <span style="color: #000000; font-style: italic; text-decoration: underline;">vector</span><span style="color: #7388d6; font-weight: bold;">&lt;</span><span style="color: #000000; font-style: italic; text-decoration: underline;">string</span><span style="color: #7388d6; font-weight: bold;">&gt;</span><span style="color: #7F0055; font-weight: bold;">&amp;</span> <span style="color: #000000;">vs</span>, <span style="color: #000000; font-style: italic; text-decoration: underline;">vector</span><span style="color: #7388d6; font-weight: bold;">&lt;</span><span style="color: #000000; font-style: italic; text-decoration: underline;">string</span><span style="color: #7388d6; font-weight: bold;">&gt;</span><span style="color: #7F0055; font-weight: bold;">&amp;</span> <span style="color: #000000;">vs2</span><span style="color: #707183;">)</span>
<span style="color: #707183;">{</span>
    <span style="color: #3a5fcd; font-weight: bold;">copy</span><span style="color: #7388d6;">(</span>vi.<span style="color: #3a5fcd; font-weight: bold; font-style: italic;">begin</span><span style="color: #909183;">()</span>, vi.<span style="color: #3a5fcd; font-weight: bold; font-style: italic;">end</span><span style="color: #909183;">()</span>, vi2.<span style="color: #3a5fcd; font-weight: bold; font-style: italic;">begin</span><span style="color: #909183;">()</span><span style="color: #7388d6;">)</span>; <span style="color: #3F7F5F;">// uses memmove</span>
    <span style="color: #3a5fcd; font-weight: bold;">copy</span><span style="color: #7388d6;">(</span>vs.<span style="color: #3a5fcd; font-weight: bold; font-style: italic;">begin</span><span style="color: #909183;">()</span>, vs.<span style="color: #3a5fcd; font-weight: bold; font-style: italic;">end</span><span style="color: #909183;">()</span>, vs2.<span style="color: #3a5fcd; font-weight: bold; font-style: italic;">begin</span><span style="color: #909183;">()</span><span style="color: #7388d6;">)</span>; <span style="color: #3F7F5F;">// uses a loop calling copy constructors</span>
<span style="color: #707183;">}</span>
</pre>
</div>

<p>
这是一个通用的、强大的编译时算法选择技术。
</p>


<p>
注意
</p>

<p>
当 <code>concept</code>  大规模应用的时候，可以直接选择不同实现方式：
</p>

<div class="org-src-container">
<pre class="src src-C++"><span style="color: #7F0055; font-weight: bold;">template</span><span style="color: #707183; font-weight: bold;">&lt;</span><span style="color: #7F0055; font-weight: bold;">class</span> <span style="color: #000000; font-style: italic; text-decoration: underline;">Iter</span><span style="color: #707183; font-weight: bold;">&gt;</span>
    <span style="color: #7F0055; font-weight: bold;">requires</span> <span style="color: #000000; font-style: italic; text-decoration: underline;">Pod</span><span style="color: #707183; font-weight: bold;">&lt;</span><span style="color: #000000; font-style: italic; text-decoration: underline;">Value_type</span><span style="color: #7388d6; font-weight: bold;">&lt;</span><span style="color: #000000; font-style: italic; text-decoration: underline;">Iter</span><span style="color: #7388d6; font-weight: bold;">&gt;</span><span style="color: #707183; font-weight: bold;">&gt;</span>
<span style="color: #000000; font-style: italic; text-decoration: underline;">Out</span> <span style="color: #0000ff; font-weight: bold;">copy_helper</span><span style="color: #707183;">(</span><span style="color: #000000; font-style: italic; text-decoration: underline;">In</span>, <span style="color: #000000; font-style: italic; text-decoration: underline;">first</span>, <span style="color: #000000; font-style: italic; text-decoration: underline;">In</span> <span style="color: #000000;">last</span>, <span style="color: #000000; font-style: italic; text-decoration: underline;">Out</span> <span style="color: #000000;">out</span><span style="color: #707183;">)</span>
<span style="color: #707183;">{</span>
    <span style="color: #3F7F5F;">// use memmove</span>
<span style="color: #707183;">}</span>

<span style="color: #7F0055; font-weight: bold;">template</span><span style="color: #707183; font-weight: bold;">&lt;</span><span style="color: #7F0055; font-weight: bold;">class</span> <span style="color: #000000; font-style: italic; text-decoration: underline;">Iter</span><span style="color: #707183; font-weight: bold;">&gt;</span>
<span style="color: #000000; font-style: italic; text-decoration: underline;">Out</span> <span style="color: #0000ff; font-weight: bold;">copy_helper</span><span style="color: #707183;">(</span><span style="color: #000000; font-style: italic; text-decoration: underline;">In</span>, <span style="color: #000000; font-style: italic; text-decoration: underline;">first</span>, <span style="color: #000000; font-style: italic; text-decoration: underline;">In</span> <span style="color: #000000;">last</span>, <span style="color: #000000; font-style: italic; text-decoration: underline;">Out</span> <span style="color: #000000;">out</span><span style="color: #707183;">)</span>
<span style="color: #707183;">{</span>
    <span style="color: #3F7F5F;">// use loop calling copy constructors</span>
<span style="color: #707183;">}</span>
</pre>
</div>
